app/controllers/api/v1/drumkits_controller.rb

  def index

    @drumkits = Drumkit.all
---
SELECT "drumkits".* FROM "drumkits"

  def create
    @drumkit = Drumkit.create(drumkit_params)
---
INSERT INTO "drumkits" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Test DrumKit"], ["created_at", "2019-04-17 20:57:30.265946"], ["updated_at", "2019-04-17 20:57:30.265946"]]