app/controllers/api/v1/kit_sounds_controller.rb

INSERT INTO "kit_sounds" ("drumkit_id", "sound_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["drumkit_id", 16], ["sound_id", 50], ["created_at", "2019-04-18 03:23:25.500814"], ["updated_at", "2019-04-18 03:23:25.500814"]]
---
  def create
    @kitsound = KitSound.create(sound_params)