app/controllers/api/v1/sounds_controller.rb

SELECT "kit_sounds".* FROM "kit_sounds" WHERE "kit_sounds"."sound_id" = $1  [["sound_id", 9]]
SELECT "sounds".* FROM "sounds"
---
  def index
    @sounds = Sound.all

INSERT INTO "sounds" ("sound_url", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["sound_url", "TESTING !!!!!"], ["created_at", "2019-04-17 20:25:10.753102"], ["updated_at", "2019-04-17 20:25:10.753102"]]
---
  def create
    @sound = Sound.create(sound_params)

SELECT "kit_sounds".* FROM "kit_sounds" WHERE "kit_sounds"."sound_id" = $1  [["sound_id", 9]]
---
  def find_sound
    @sound = Sound.find(params[:id])